tap "homebrew/cask"
# commend line
brew "zsh"
brew "mas"
brew "git"
brew "fzf"
brew "eza"
# package version manager
brew "pyenv"
brew "nvm"
brew "cocoapods"
# font
cask "font-hack"
# mac app
cask "iterm2"
cask "visual-studio-code"
cask "google-chrome"
cask "fork"
cask "obsidian"
cask "raycast"
cask "1password@7"
cask "docker"
cask "claude-code"
cask "chatgpt"
cask "notion"
cask "intellij-idea"
cask "datagrip"
# mac app with mas
mas "Xcode", id: 497799835
mas "KakaoTalk", id: 869223134
mas "Spark", id: 6445813049
mas "Google Calendar", id: 1107163858
mas "margnet", id: 441258766